Files/Teoria/DataStruct/Arrays.org
* Arrays estáticos y dinámicos

** Discución y ejemplos sobre Arrays
*** ¿Qué es un array estatico?
Un array estatico es un contenedor de tamaño fijo que contiene $`n`$
elementos que son indexables en el rango de $`[0, n-1]`$.

#+begin_quote
  Con indexamples nos referimos a que a cada indice/casilla del array se
  le puede asignar un número.
#+end_quote

Cada array estatico es asignado a memoria como una porción contigua de
direcciónes de memoria. ### ¿Cuándo y donde son usados los arrays? 1.
Cuando necesitas guardar y accesar a datos secuenciales. 2. Para guardar
temporalmente objetos. 3. Usados por rutinas de IO como buffers. 4. En
tablas de consulta (/lookup tables/) y tablas de consulta inversas. 5.
Pueden ser usadas para retornar múltiples valores de una función. 6.
Usados en programación dínamica como cache de respuestas a subproblemas.

*** Complejidad
    :PROPERTIES:
    :CUSTOM_ID: complejidad
    :END:
|           | Array estático | Array dinámico |
|-----------+----------------+----------------|
| Acceso    | $`O(1)`$       | $`O(1)`$       |
| Inserción | $`N/A`$        | $`O(n)`$       |
| Anexar    | $`N/A`$        | $`O(1)`$       |
| Borrar    | $`N/A`$        | $`O(n)`$       |

#+begin_quote
siendo $`n`$ el tamaño del array.
#+end_quote

*** Ejemplo de array estáticos
Siendo un array $`A`$.

| Valor  |    44 |    12 |    -5 |    17 |     6 |     0 |     3 |     9 |   100 |
| :---:  | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |
| Índice |     0 |     1 |     2 |     3 |     4 |     5 |     6 |     7 |     8 |

Los elementos en A están referenciados por su índice. No hay otra manera
de acceder a estos elementos en el array. La anexación en un array esta
basada en O, lo cual significa el el primer elemento esta en el indice
0.

#+begin_src java
A[0] = 44
A[1] = 12
A[4] = 6
A[7] = 9
A[9] => index out of bounds!
#+end_src

** Operación de array dinámicos
Los array dinámicos pueden crecer y decrecer en su tamaño

#+begin_src java
A = [34,4]
A.add(-1)   A = [34,4,-7]
A.add(34)   A = [34,4,-7,34]
A.remove(4) A = [34,-7,34]
#+end_src

**** ¿Como implementar un Array dinámico?
Una manera de hacerlo es usando un array estático.
1. Creamos un array estático con una capacidad inicial.
2. Añadimos elementos al array llevando una cuenta de cuantos elementos hay siempre y cuando no
   sobrepasen la cantidad de casillas en el array.
3. Si al añadir elementos al array sobrepasamos su capacidad, creamos un nuevo array
   estático con el doble de capacidad y copiamos los elementos del array
original al nuevo.

