Publ/Teoria/DataStruct/Arrays.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2020-12-25 Fri 20:59 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Arrays estáticos y dinámicos</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Discución y ejemplos sobre Arrays</a></li>
<li><a href="#sec-1-2">1.2. Operación de array dinámicos</a></li>
<li><a href="#sec-1-3">1.3. Inplementación de código</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Arrays estáticos y dinámicos</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Discución y ejemplos sobre Arrays</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> ¿Qué es un array estatico?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Un array estatico es un contenedor de tamaño fijo que contiene \(`n`\)
elementos que son indexables en el rango de \(`[0, n-1]`\).
</p>

<blockquote>
<p>
Con indexamples nos referimos a que a cada indice/casilla del array se
le puede asignar un número.
</p>
</blockquote>

<p>
Cada array estatico es asignado a memoria como una porción contigua de
direcciónes de memoria. ### ¿Cuándo y donde son usados los arrays? 1.
Cuando necesitas guardar y accesar a datos secuenciales. 2. Para guardar
temporalmente objetos. 3. Usados por rutinas de IO como buffers. 4. En
tablas de consulta (<i>lookup tables</i>) y tablas de consulta inversas. 5.
Pueden ser usadas para retornar múltiples valores de una función. 6.
Usados en programación dínamica como cache de respuestas a subproblemas.
</p>
</div>
</div>

<div id="outline-container-complejidad" class="outline-4">
<h4 id="complejidad"><a id="sec-1-1-2" name="sec-1-1-2"></a><span class="section-number-4">1.1.2</span> Complejidad</h4>
<div class="outline-text-4" id="text-complejidad">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">&#xa0;</th>
<th scope="col" class="text-left">Array estático</th>
<th scope="col" class="text-left">Array dinámico</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Acceso</td>
<td class="text-left">\(`O(1)`\)</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Inserción</td>
<td class="text-left">\(`N/A`\)</td>
<td class="text-left">\(`O(n)`\)</td>
</tr>

<tr>
<td class="text-left">Anexar</td>
<td class="text-left">\(`N/A`\)</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Borrar</td>
<td class="text-left">\(`N/A`\)</td>
<td class="text-left">\(`O(n)`\)</td>
</tr>
</tbody>
</table>

<blockquote>
<p>
siendo \(`n`\) el tamaño del array.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Ejemplo de array estáticos</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Siendo un array \(`A`\).
</p>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Valor</td>
<td class="text-right">44</td>
<td class="text-right">12</td>
<td class="text-right">-5</td>
<td class="text-right">17</td>
<td class="text-right">6</td>
<td class="text-right">0</td>
<td class="text-right">3</td>
<td class="text-right">9</td>
<td class="text-right">100</td>
</tr>

<tr>
<td class="text-left">:&#x2014;:</td>
<td class="text-right">:&#x2014;:</td>
<td class="text-right">:&#x2014;:</td>
<td class="text-right">:&#x2014;:</td>
<td class="text-right">:&#x2014;:</td>
<td class="text-right">:&#x2014;:</td>
<td class="text-right">:&#x2014;:</td>
<td class="text-right">:&#x2014;:</td>
<td class="text-right">:&#x2014;:</td>
<td class="text-right">:&#x2014;:</td>
</tr>

<tr>
<td class="text-left">Índice</td>
<td class="text-right">0</td>
<td class="text-right">1</td>
<td class="text-right">2</td>
<td class="text-right">3</td>
<td class="text-right">4</td>
<td class="text-right">5</td>
<td class="text-right">6</td>
<td class="text-right">7</td>
<td class="text-right">8</td>
</tr>
</tbody>
</table>

<p>
Los elementos en A están referenciados por su índice. No hay otra manera
de acceder a estos elementos en el array. La anexación en un array esta
basada en O, lo cual significa el el primer elemento esta en el indice
</p>
<ol class="org-ol">
<li></li>
</ol>

<div class="org-src-container">

<pre class="src src-java">A<span style="color: #81A1C1;">[</span><span style="color: #B48EAD; font-weight: bold;">0</span><span style="color: #81A1C1;">]</span> = <span style="color: #B48EAD; font-weight: bold;">44</span>
A<span style="color: #81A1C1;">[</span><span style="color: #B48EAD; font-weight: bold;">1</span><span style="color: #81A1C1;">]</span> = <span style="color: #B48EAD; font-weight: bold;">12</span>
A<span style="color: #81A1C1;">[</span><span style="color: #B48EAD; font-weight: bold;">4</span><span style="color: #81A1C1;">]</span> = <span style="color: #B48EAD; font-weight: bold;">6</span>
A<span style="color: #81A1C1;">[</span><span style="color: #B48EAD; font-weight: bold;">7</span><span style="color: #81A1C1;">]</span> = <span style="color: #B48EAD; font-weight: bold;">9</span>
A<span style="color: #81A1C1;">[</span><span style="color: #B48EAD; font-weight: bold;">9</span><span style="color: #81A1C1;">]</span> =&gt; index out of bounds!
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Operación de array dinámicos</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Los array dinámicos pueden crecer y decrecer en su tamaño
</p>

<div class="org-src-container">

<pre class="src src-java">A = <span style="color: #81A1C1;">[</span><span style="color: #B48EAD; font-weight: bold;">34</span>,<span style="color: #B48EAD; font-weight: bold;">4</span><span style="color: #81A1C1;">]</span>
A.add<span style="color: #81A1C1;">(</span>-<span style="color: #B48EAD; font-weight: bold;">1</span><span style="color: #81A1C1;">)</span>   A = <span style="color: #81A1C1;">[</span><span style="color: #B48EAD; font-weight: bold;">34</span>,<span style="color: #B48EAD; font-weight: bold;">4</span>,-<span style="color: #B48EAD; font-weight: bold;">7</span><span style="color: #81A1C1;">]</span>
A.add<span style="color: #81A1C1;">(</span><span style="color: #B48EAD; font-weight: bold;">34</span><span style="color: #81A1C1;">)</span>   A = <span style="color: #81A1C1;">[</span><span style="color: #B48EAD; font-weight: bold;">34</span>,<span style="color: #B48EAD; font-weight: bold;">4</span>,-<span style="color: #B48EAD; font-weight: bold;">7</span>,<span style="color: #B48EAD; font-weight: bold;">34</span><span style="color: #81A1C1;">]</span>
A.remove<span style="color: #81A1C1;">(</span><span style="color: #B48EAD; font-weight: bold;">4</span><span style="color: #81A1C1;">)</span> A = <span style="color: #81A1C1;">[</span><span style="color: #B48EAD; font-weight: bold;">34</span>,-<span style="color: #B48EAD; font-weight: bold;">7</span>,<span style="color: #B48EAD; font-weight: bold;">34</span><span style="color: #81A1C1;">]</span>
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="sec-1-2-0-1" name="sec-1-2-0-1"></a>¿Como implementar un Array dinámico?<br ><div class="outline-text-5" id="text-1-2-0-1">
<p>
Una manera de hacerlo es usando un array estático.
</p>
<ol class="org-ol">
<li>Creamos un array estático con una capacidad inicial.
</li>
<li>Añadimos elementos al array llevando una cuenta de cuantos elementos hay siempre y cuando no
sobrepasen la cantidad de casillas en el array.
</li>
<li>Si al añadir elementos al array sobrepasamos su capacidad, creamos un nuevo array
estático con el doble de capacidad y copiamos los elementos del array
</li>
</ol>
<p>
original al nuevo.
</p>
</div>
</li></ol>
</div>
