Publ/Teoria/DataStruct/Arrays.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Inplementación de código</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #78808f; font-style: italic;">/**</span>
<span style="color: #78808f; font-style: italic;">* A generic dynamic array implementation</span>
<span style="color: #78808f; font-style: italic;">*</span>
<span style="color: #78808f; font-style: italic;">* </span><span style="color: #81A1C1; font-style: italic;">@author</span><span style="color: #78808f; font-style: italic;"> William Fiset, william.alexandre.fiset@gmail.com</span>
<span style="color: #78808f; font-style: italic;">*/</span>
<span style="color: #81A1C1; font-style: italic;">package</span> com.williamfiset.algorithms.datastructures.<span style="color: #81A1C1;">dynamicarray</span>;

    <span style="color: #81A1C1;">@SuppressWarnings</span><span style="color: #81A1C1;">(</span><span style="color: #A3BE8C;">"unchecked"</span><span style="color: #81A1C1;">)</span>
    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #81A1C1; font-style: italic;">class</span> <span style="color: #8FBCBB;">DynamicArray</span><span style="color: #81A1C1;">&lt;</span><span style="color: #8FBCBB;">T</span><span style="color: #81A1C1;">&gt;</span> <span style="color: #81A1C1; font-style: italic;">implements</span> <span style="color: #8FBCBB;">Iterable</span><span style="color: #81A1C1;">&lt;</span><span style="color: #8FBCBB;">T</span><span style="color: #81A1C1;">&gt;</span> <span style="color: #81A1C1;">{</span>

    <span style="color: #81A1C1; font-style: italic;">private</span> <span style="color: #8FBCBB;">T</span><span style="color: #B48EAD;">[]</span> <span style="color: #D8DEE9;">arr</span>;
    <span style="color: #81A1C1; font-style: italic;">private</span> <span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">len</span> = <span style="color: #B48EAD; font-weight: bold;">0</span>; <span style="color: #6f7787; font-style: italic;">// </span><span style="color: #6f7787; font-style: italic;">length user thinks array is</span>
    <span style="color: #81A1C1; font-style: italic;">private</span> <span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">capacity</span> = <span style="color: #B48EAD; font-weight: bold;">0</span>; <span style="color: #6f7787; font-style: italic;">// </span><span style="color: #6f7787; font-style: italic;">Actual array size</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">DynamicArray</span><span style="color: #B48EAD;">()</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">this</span><span style="color: #A3BE8C;">(</span><span style="color: #B48EAD; font-weight: bold;">16</span><span style="color: #A3BE8C;">)</span>;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">DynamicArray</span><span style="color: #B48EAD;">(</span><span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">capacity</span><span style="color: #B48EAD;">)</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #A3BE8C;">(</span>capacity &lt; <span style="color: #B48EAD; font-weight: bold;">0</span><span style="color: #A3BE8C;">)</span> <span style="color: #81A1C1; font-style: italic;">throw</span> <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #8FBCBB;">IllegalArgumentException</span><span style="color: #A3BE8C;">(</span><span style="color: #A3BE8C;">"Illegal Capacity: "</span> + capacity<span style="color: #A3BE8C;">)</span>;
      <span style="color: #81A1C1; font-style: italic;">this</span>.capacity = capacity;
      arr = <span style="color: #A3BE8C;">(</span><span style="color: #8FBCBB;">T</span><span style="color: #81A1C1;">[]</span><span style="color: #A3BE8C;">)</span> <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #8FBCBB;">Object</span><span style="color: #A3BE8C;">[</span>capacity<span style="color: #A3BE8C;">]</span>;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">int</span> <span style="color: #8FBCBB;">size</span><span style="color: #B48EAD;">()</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">return</span> len;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">boolean</span> <span style="color: #8FBCBB;">isEmpty</span><span style="color: #B48EAD;">()</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">return</span> size<span style="color: #A3BE8C;">()</span> == <span style="color: #B48EAD; font-weight: bold;">0</span>;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">T</span> <span style="color: #8FBCBB;">get</span><span style="color: #B48EAD;">(</span><span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">index</span><span style="color: #B48EAD;">)</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #A3BE8C;">(</span>index &gt;= len || index &lt; <span style="color: #B48EAD; font-weight: bold;">0</span><span style="color: #A3BE8C;">)</span> <span style="color: #81A1C1; font-style: italic;">throw</span> <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #8FBCBB;">IndexOutOfBoundsException</span><span style="color: #A3BE8C;">()</span>;
      <span style="color: #81A1C1; font-style: italic;">return</span> arr<span style="color: #A3BE8C;">[</span>index<span style="color: #A3BE8C;">]</span>;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">void</span> <span style="color: #8FBCBB;">set</span><span style="color: #B48EAD;">(</span><span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">index</span>, <span style="color: #8FBCBB;">T</span> <span style="color: #D8DEE9;">elem</span><span style="color: #B48EAD;">)</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #A3BE8C;">(</span>index &gt;= len || index &lt; <span style="color: #B48EAD; font-weight: bold;">0</span><span style="color: #A3BE8C;">)</span> <span style="color: #81A1C1; font-style: italic;">throw</span> <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #8FBCBB;">IndexOutOfBoundsException</span><span style="color: #A3BE8C;">()</span>;
      arr<span style="color: #A3BE8C;">[</span>index<span style="color: #A3BE8C;">]</span> = elem;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">void</span> <span style="color: #8FBCBB;">clear</span><span style="color: #B48EAD;">()</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">for</span> <span style="color: #A3BE8C;">(</span><span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">i</span> = <span style="color: #B48EAD; font-weight: bold;">0</span>; i &lt; <span style="color: #8FBCBB;">len</span>; i++<span style="color: #A3BE8C;">)</span> arr<span style="color: #A3BE8C;">[</span>i<span style="color: #A3BE8C;">]</span> = <span style="color: #81A1C1;">null</span>;
      len = <span style="color: #B48EAD; font-weight: bold;">0</span>;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">void</span> <span style="color: #8FBCBB;">add</span><span style="color: #B48EAD;">(</span><span style="color: #8FBCBB;">T</span> <span style="color: #D8DEE9;">elem</span><span style="color: #B48EAD;">)</span> <span style="color: #B48EAD;">{</span>

      <span style="color: #6f7787; font-style: italic;">// </span><span style="color: #6f7787; font-style: italic;">Time to resize!</span>
      <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #A3BE8C;">(</span>len + <span style="color: #B48EAD; font-weight: bold;">1</span> &gt;= capacity<span style="color: #A3BE8C;">)</span> <span style="color: #A3BE8C;">{</span>
        <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #81A1C1;">(</span>capacity == <span style="color: #B48EAD; font-weight: bold;">0</span><span style="color: #81A1C1;">)</span> capacity = <span style="color: #B48EAD; font-weight: bold;">1</span>;
        <span style="color: #81A1C1; font-style: italic;">else</span> capacity *= <span style="color: #B48EAD; font-weight: bold;">2</span>; <span style="color: #6f7787; font-style: italic;">// </span><span style="color: #6f7787; font-style: italic;">double the size</span>
        <span style="color: #8FBCBB;">T</span><span style="color: #81A1C1;">[]</span> <span style="color: #D8DEE9;">new_arr</span> = <span style="color: #81A1C1;">(</span><span style="color: #8FBCBB;">T</span><span style="color: #B48EAD;">[]</span><span style="color: #81A1C1;">)</span> <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #8FBCBB;">Object</span><span style="color: #81A1C1;">[</span>capacity<span style="color: #81A1C1;">]</span>;
        <span style="color: #81A1C1; font-style: italic;">for</span> <span style="color: #81A1C1;">(</span><span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">i</span> = <span style="color: #B48EAD; font-weight: bold;">0</span>; i &lt; <span style="color: #8FBCBB;">len</span>; i++<span style="color: #81A1C1;">)</span> new_arr<span style="color: #81A1C1;">[</span>i<span style="color: #81A1C1;">]</span> = arr<span style="color: #81A1C1;">[</span>i<span style="color: #81A1C1;">]</span>;
        arr = new_arr; <span style="color: #6f7787; font-style: italic;">// </span><span style="color: #6f7787; font-style: italic;">arr has extra nulls padded</span>
      <span style="color: #A3BE8C;">}</span>

      arr<span style="color: #A3BE8C;">[</span>len++<span style="color: #A3BE8C;">]</span> = elem;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #6f7787; font-style: italic;">// </span><span style="color: #6f7787; font-style: italic;">Removes an element at the specified index in this array.</span>
    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">T</span> <span style="color: #8FBCBB;">removeAt</span><span style="color: #B48EAD;">(</span><span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">rm_index</span><span style="color: #B48EAD;">)</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #A3BE8C;">(</span>rm_index &gt;= len || rm_index &lt; <span style="color: #B48EAD; font-weight: bold;">0</span><span style="color: #A3BE8C;">)</span> <span style="color: #81A1C1; font-style: italic;">throw</span> <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #8FBCBB;">IndexOutOfBoundsException</span><span style="color: #A3BE8C;">()</span>;
      <span style="color: #8FBCBB;">T</span> <span style="color: #D8DEE9;">data</span> = arr<span style="color: #A3BE8C;">[</span>rm_index<span style="color: #A3BE8C;">]</span>;
      <span style="color: #8FBCBB;">T</span><span style="color: #A3BE8C;">[]</span> <span style="color: #D8DEE9;">new_arr</span> = <span style="color: #A3BE8C;">(</span><span style="color: #8FBCBB;">T</span><span style="color: #81A1C1;">[]</span><span style="color: #A3BE8C;">)</span> <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #8FBCBB;">Object</span><span style="color: #A3BE8C;">[</span>len - <span style="color: #B48EAD; font-weight: bold;">1</span><span style="color: #A3BE8C;">]</span>;
      <span style="color: #81A1C1; font-style: italic;">for</span> <span style="color: #A3BE8C;">(</span><span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">i</span> = <span style="color: #B48EAD; font-weight: bold;">0</span>, <span style="color: #D8DEE9;">j</span> = <span style="color: #B48EAD; font-weight: bold;">0</span>; i &lt; <span style="color: #8FBCBB;">len</span>; i++, j++<span style="color: #A3BE8C;">)</span>
        <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #A3BE8C;">(</span>i == rm_index<span style="color: #A3BE8C;">)</span> j--; <span style="color: #6f7787; font-style: italic;">// </span><span style="color: #6f7787; font-style: italic;">Skip over rm_index by fixing j temporarily</span>
        <span style="color: #81A1C1; font-style: italic;">else</span> new_arr<span style="color: #A3BE8C;">[</span>j<span style="color: #A3BE8C;">]</span> = arr<span style="color: #A3BE8C;">[</span>i<span style="color: #A3BE8C;">]</span>;
      arr = new_arr;
      capacity = --len;
      <span style="color: #81A1C1; font-style: italic;">return</span> data;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">boolean</span> <span style="color: #8FBCBB;">remove</span><span style="color: #B48EAD;">(</span><span style="color: #8FBCBB;">Object</span> <span style="color: #D8DEE9;">obj</span><span style="color: #B48EAD;">)</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">index</span> = indexOf<span style="color: #A3BE8C;">(</span>obj<span style="color: #A3BE8C;">)</span>;
      <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #A3BE8C;">(</span>index == -<span style="color: #B48EAD; font-weight: bold;">1</span><span style="color: #A3BE8C;">)</span> <span style="color: #81A1C1; font-style: italic;">return</span> <span style="color: #81A1C1;">false</span>;
      removeAt<span style="color: #A3BE8C;">(</span>index<span style="color: #A3BE8C;">)</span>;
      <span style="color: #81A1C1; font-style: italic;">return</span> <span style="color: #81A1C1;">true</span>;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">int</span> <span style="color: #8FBCBB;">indexOf</span><span style="color: #B48EAD;">(</span><span style="color: #8FBCBB;">Object</span> <span style="color: #D8DEE9;">obj</span><span style="color: #B48EAD;">)</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">for</span> <span style="color: #A3BE8C;">(</span><span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">i</span> = <span style="color: #B48EAD; font-weight: bold;">0</span>; i &lt; <span style="color: #8FBCBB;">len</span>; i++<span style="color: #A3BE8C;">)</span> <span style="color: #A3BE8C;">{</span>
        <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #81A1C1;">(</span>obj == <span style="color: #81A1C1;">null</span><span style="color: #81A1C1;">)</span> <span style="color: #81A1C1;">{</span>
          <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #B48EAD;">(</span>arr<span style="color: #A3BE8C;">[</span>i<span style="color: #A3BE8C;">]</span> == <span style="color: #81A1C1;">null</span><span style="color: #B48EAD;">)</span> <span style="color: #81A1C1; font-style: italic;">return</span> i;
        <span style="color: #81A1C1;">}</span> <span style="color: #81A1C1; font-style: italic;">else</span> <span style="color: #81A1C1;">{</span>
          <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #B48EAD;">(</span>obj.equals<span style="color: #A3BE8C;">(</span>arr<span style="color: #81A1C1;">[</span>i<span style="color: #81A1C1;">]</span><span style="color: #A3BE8C;">)</span><span style="color: #B48EAD;">)</span> <span style="color: #81A1C1; font-style: italic;">return</span> i;
        <span style="color: #81A1C1;">}</span>
      <span style="color: #A3BE8C;">}</span>
      <span style="color: #81A1C1; font-style: italic;">return</span> -<span style="color: #B48EAD; font-weight: bold;">1</span>;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">boolean</span> <span style="color: #8FBCBB;">contains</span><span style="color: #B48EAD;">(</span><span style="color: #8FBCBB;">Object</span> <span style="color: #D8DEE9;">obj</span><span style="color: #B48EAD;">)</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">return</span> indexOf<span style="color: #A3BE8C;">(</span>obj<span style="color: #A3BE8C;">)</span> != -<span style="color: #B48EAD; font-weight: bold;">1</span>;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #6f7787; font-style: italic;">// </span><span style="color: #6f7787; font-style: italic;">Iterator is still fast but not as fast as iterative for loop</span>
    <span style="color: #81A1C1;">@Override</span>
    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #81A1C1;">java</span>.<span style="color: #81A1C1;">util</span>.<span style="color: #8FBCBB;">Iterator</span><span style="color: #B48EAD;">&lt;</span><span style="color: #8FBCBB;">T</span><span style="color: #B48EAD;">&gt;</span> <span style="color: #8FBCBB;">iterator</span><span style="color: #B48EAD;">()</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">return</span> <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #81A1C1;">java</span>.<span style="color: #81A1C1;">util</span>.<span style="color: #8FBCBB;">Iterator</span><span style="color: #A3BE8C;">&lt;</span><span style="color: #8FBCBB;">T</span><span style="color: #A3BE8C;">&gt;()</span> <span style="color: #A3BE8C;">{</span>
        <span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">index</span> = <span style="color: #B48EAD; font-weight: bold;">0</span>;

        <span style="color: #81A1C1;">@Override</span>
        <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">boolean</span> <span style="color: #8FBCBB;">hasNext</span><span style="color: #81A1C1;">()</span> <span style="color: #81A1C1;">{</span>
          <span style="color: #81A1C1; font-style: italic;">return</span> index &lt; <span style="color: #8FBCBB;">len</span>;
        <span style="color: #81A1C1;">}</span>

        <span style="color: #81A1C1;">@Override</span>
        <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">T</span> <span style="color: #8FBCBB;">next</span><span style="color: #81A1C1;">()</span> <span style="color: #81A1C1;">{</span>
          <span style="color: #81A1C1; font-style: italic;">return</span> arr<span style="color: #B48EAD;">[</span>index++<span style="color: #B48EAD;">]</span>;
        <span style="color: #81A1C1;">}</span>

        <span style="color: #81A1C1;">@Override</span>
        <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">void</span> <span style="color: #8FBCBB;">remove</span><span style="color: #81A1C1;">()</span> <span style="color: #81A1C1;">{</span>
          <span style="color: #81A1C1; font-style: italic;">throw</span> <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #8FBCBB;">UnsupportedOperationException</span><span style="color: #B48EAD;">()</span>;
        <span style="color: #81A1C1;">}</span>
      <span style="color: #A3BE8C;">}</span>;
    <span style="color: #B48EAD;">}</span>

    <span style="color: #81A1C1;">@Override</span>
    <span style="color: #81A1C1; font-style: italic;">public</span> <span style="color: #8FBCBB;">String</span> <span style="color: #8FBCBB;">toString</span><span style="color: #B48EAD;">()</span> <span style="color: #B48EAD;">{</span>
      <span style="color: #81A1C1; font-style: italic;">if</span> <span style="color: #A3BE8C;">(</span>len == <span style="color: #B48EAD; font-weight: bold;">0</span><span style="color: #A3BE8C;">)</span> <span style="color: #81A1C1; font-style: italic;">return</span> <span style="color: #A3BE8C;">"[]"</span>;
      <span style="color: #81A1C1; font-style: italic;">else</span> <span style="color: #A3BE8C;">{</span>
        <span style="color: #8FBCBB;">StringBuilder</span> <span style="color: #D8DEE9;">sb</span> = <span style="color: #81A1C1; font-style: italic;">new</span> <span style="color: #8FBCBB;">StringBuilder</span><span style="color: #81A1C1;">(</span>len<span style="color: #81A1C1;">)</span>.append<span style="color: #81A1C1;">(</span><span style="color: #A3BE8C;">"["</span><span style="color: #81A1C1;">)</span>;
        <span style="color: #81A1C1; font-style: italic;">for</span> <span style="color: #81A1C1;">(</span><span style="color: #8FBCBB;">int</span> <span style="color: #D8DEE9;">i</span> = <span style="color: #B48EAD; font-weight: bold;">0</span>; i &lt; <span style="color: #8FBCBB;">len</span> - <span style="color: #B48EAD; font-weight: bold;">1</span>; i++<span style="color: #81A1C1;">)</span> sb.append<span style="color: #81A1C1;">(</span>arr<span style="color: #B48EAD;">[</span>i<span style="color: #B48EAD;">]</span> + <span style="color: #A3BE8C;">", "</span><span style="color: #81A1C1;">)</span>;
        <span style="color: #81A1C1; font-style: italic;">return</span> sb.append<span style="color: #81A1C1;">(</span>arr<span style="color: #B48EAD;">[</span>len - <span style="color: #B48EAD; font-weight: bold;">1</span><span style="color: #B48EAD;">]</span> + <span style="color: #A3BE8C;">"]"</span><span style="color: #81A1C1;">)</span>.toString<span style="color: #81A1C1;">()</span>;
      <span style="color: #A3BE8C;">}</span>
    <span style="color: #B48EAD;">}</span>
<span style="color: #81A1C1;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2020-12-25 Fri 20:59</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.5)</p>
</div>
</footer>
</body>
</html>
